Model: "mobilenet_1.00_224"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
01 input_1 (InputLayer)         [(None, 224, 224, 3)]     0
_________________________________________________________________
02 conv1_pad (ZeroPadding2D)    (None, 225, 225, 3)       0
_________________________________________________________________
03 conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
04 conv1_bn (BatchNormalization (None, 112, 112, 32)      128
_________________________________________________________________
05 conv1_relu (ReLU)            (None, 112, 112, 32)      0
_________________________________________________________________
06 conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288
_________________________________________________________________
07 conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128
_________________________________________________________________
08 conv_dw_1_relu (ReLU)        (None, 112, 112, 32)      0
_________________________________________________________________
09 conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048
_________________________________________________________________
10 conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256
_________________________________________________________________
11 conv_pw_1_relu (ReLU)        (None, 112, 112, 64)      0
_________________________________________________________________
12 conv_pad_2 (ZeroPadding2D)   (None, 113, 113, 64)      0
_________________________________________________________________
13 conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576
_________________________________________________________________
14 conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256
_________________________________________________________________
15 conv_dw_2_relu (ReLU)        (None, 56, 56, 64)        0
_________________________________________________________________
16 conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192
_________________________________________________________________
17 conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512
_________________________________________________________________
18 conv_pw_2_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
19 conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152
_________________________________________________________________
20 conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512
_________________________________________________________________
21 conv_dw_3_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
22 conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384
_________________________________________________________________
23 conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
24 conv_pw_3_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
25 conv_pad_4 (ZeroPadding2D)   (None, 57, 57, 128)       0
_________________________________________________________________
26 conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152
_________________________________________________________________
27 conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512
_________________________________________________________________
28 conv_dw_4_relu (ReLU)        (None, 28, 28, 128)       0
_________________________________________________________________
29 conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768
_________________________________________________________________
30 conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
31 conv_pw_4_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
32 conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304
_________________________________________________________________
33 conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
34 conv_dw_5_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
35 conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536
_________________________________________________________________
36 conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
37 conv_pw_5_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
38 conv_pad_6 (ZeroPadding2D)   (None, 29, 29, 256)       0
_________________________________________________________________
39 conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304
_________________________________________________________________
40 conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024
_________________________________________________________________
41 conv_dw_6_relu (ReLU)        (None, 14, 14, 256)       0
_________________________________________________________________
42 conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072
_________________________________________________________________
43 conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
44 conv_pw_6_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
45 conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
46 conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
47 conv_dw_7_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
48 conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
49 conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
50 conv_pw_7_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
51 conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
52 conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
53 conv_dw_8_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
54 conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
55 conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
56 conv_pw_8_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
57 conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
58 conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
59 conv_dw_9_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
60 conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
61 conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
62 conv_pw_9_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
63 conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608
_________________________________________________________________
64 conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
65 conv_dw_10_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
66 conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144
_________________________________________________________________
67 conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
68 conv_pw_10_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
69 conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608
_________________________________________________________________
70 conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
71 conv_dw_11_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
72 conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144
_________________________________________________________________
73 conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
74 conv_pw_11_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
75 conv_pad_12 (ZeroPadding2D)  (None, 15, 15, 512)       0
_________________________________________________________________
76 conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608
_________________________________________________________________
77 conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048
_________________________________________________________________
78 conv_dw_12_relu (ReLU)       (None, 7, 7, 512)         0
_________________________________________________________________
79 conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288
_________________________________________________________________
80 conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
81 conv_pw_12_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
82 conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216
_________________________________________________________________
83 conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
84 conv_dw_13_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
85 conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576
_________________________________________________________________
86 conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
87 conv_pw_13_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
88 global_average_pooling2d (Gl (None, 1024)              0
_________________________________________________________________
89 reshape_1 (Reshape)          (None, 1, 1, 1024)        0
_________________________________________________________________
90 dropout (Dropout)            (None, 1, 1, 1024)        0
_________________________________________________________________
91 conv_preds (Conv2D)          (None, 1, 1, 1000)        1025000
_________________________________________________________________
92 reshape_2 (Reshape)          (None, 1000)              0
_________________________________________________________________
93 act_softmax (Activation)     (None, 1000)              0
=================================================================
Total params: 4,253,864
Trainable params: 4,231,976
Non-trainable params: 21,888

_________________________________________________________________
None
Model: "model"
Model: "mobilenet_1.00_224"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
01 input_1 (InputLayer)         [(None, 224, 224, 3)]     0
_________________________________________________________________
02 conv1_pad (ZeroPadding2D)    (None, 225, 225, 3)       0
_________________________________________________________________
03 conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
04 conv1_bn (BatchNormalization (None, 112, 112, 32)      128
_________________________________________________________________
05 conv1_relu (ReLU)            (None, 112, 112, 32)      0
_________________________________________________________________
06 conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288
_________________________________________________________________
07 conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128
_________________________________________________________________
08 conv_dw_1_relu (ReLU)        (None, 112, 112, 32)      0
_________________________________________________________________
09 conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048
_________________________________________________________________
10 conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256
_________________________________________________________________
11 conv_pw_1_relu (ReLU)        (None, 112, 112, 64)      0
_________________________________________________________________
12 conv_pad_2 (ZeroPadding2D)   (None, 113, 113, 64)      0
_________________________________________________________________
13 conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576
_________________________________________________________________
14 conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256
_________________________________________________________________
15 conv_dw_2_relu (ReLU)        (None, 56, 56, 64)        0
_________________________________________________________________
16 conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192
_________________________________________________________________
17 conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512
_________________________________________________________________
18 conv_pw_2_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
19 conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152
_________________________________________________________________
20 conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512
_________________________________________________________________
21 conv_dw_3_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
22 conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384
_________________________________________________________________
23 conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
24 conv_pw_3_relu (ReLU)        (None, 56, 56, 128)       0
_________________________________________________________________
25 conv_pad_4 (ZeroPadding2D)   (None, 57, 57, 128)       0
_________________________________________________________________
26 conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152
_________________________________________________________________
27 conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512
_________________________________________________________________
28 conv_dw_4_relu (ReLU)        (None, 28, 28, 128)       0
_________________________________________________________________
29 conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768
_________________________________________________________________
30 conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
31 conv_pw_4_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
32 conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304
_________________________________________________________________
33 conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
34 conv_dw_5_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
35 conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536
_________________________________________________________________
36 conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024
_________________________________________________________________
37 conv_pw_5_relu (ReLU)        (None, 28, 28, 256)       0
_________________________________________________________________
38 conv_pad_6 (ZeroPadding2D)   (None, 29, 29, 256)       0
_________________________________________________________________
39 conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304
_________________________________________________________________
40 conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024
_________________________________________________________________
41 conv_dw_6_relu (ReLU)        (None, 14, 14, 256)       0
_________________________________________________________________
42 conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072
_________________________________________________________________
43 conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
44 conv_pw_6_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
45 conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
46 conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
47 conv_dw_7_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
48 conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
49 conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
50 conv_pw_7_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
51 conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
52 conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
53 conv_dw_8_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
54 conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
55 conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
56 conv_pw_8_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
57 conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608
_________________________________________________________________
58 conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
59 conv_dw_9_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
60 conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144
_________________________________________________________________
61 conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048
_________________________________________________________________
62 conv_pw_9_relu (ReLU)        (None, 14, 14, 512)       0
_________________________________________________________________
63 conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608
_________________________________________________________________
64 conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
65 conv_dw_10_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
66 conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144
_________________________________________________________________
67 conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
68 conv_pw_10_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
69 conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608
_________________________________________________________________
70 conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
71 conv_dw_11_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
72 conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144
_________________________________________________________________
73 conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048
_________________________________________________________________
74 conv_pw_11_relu (ReLU)       (None, 14, 14, 512)       0
_________________________________________________________________
75 conv_pad_12 (ZeroPadding2D)  (None, 15, 15, 512)       0
_________________________________________________________________
76 conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608
_________________________________________________________________
77 conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048
_________________________________________________________________
78 conv_dw_12_relu (ReLU)       (None, 7, 7, 512)         0
_________________________________________________________________
79 conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288
_________________________________________________________________
80 conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
81 conv_pw_12_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
82 conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216
_________________________________________________________________
83 conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
84 conv_dw_13_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
85 conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576
_________________________________________________________________
86 conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096
_________________________________________________________________
87 conv_pw_13_relu (ReLU)       (None, 7, 7, 1024)        0
_________________________________________________________________
88 global_average_pooling2d (Gl (None, 1024)              0
_________________________________________________________________
89 dropout (Dropout)            (None, 1024)              0
_________________________________________________________________
90 dense (Dense)                (None, 7)                 7175
=================================================================
Total params: 3,236,039
Trainable params: 1,869,831
Non-trainable params: 1,366,208
_________________________________________________________________